{
  "id": "e045ea3d-a72a-4487-8ced-c3615033243c",
  "name": "musing_volhard",
  "sources": [
    {
      "id": "4151632a-8b92-49e0-939a-442220827bef",
      "title": "C:/Users/alenk/Desktop/bitcoin.pdf (0)",
      "type": "pdf",
      "content": "Bitcoin: A Peer-to-Peer Electronic Cash System\nAbstract.   A purely peer-to-peer version of electronic cash would allow online \npayments to be sent directly from one party to another without going through a \nfinancial institution.  Digital signatures provide part of the solution, but the main \nbenefits are lost if a trusted third party is still required to prevent double-spending. \nWe propose a solution to the double-spending problem using a peer-to-peer network. \nThe network timestamps transactions by hashing them into an ongoing chain of \nhash-based proof-of-work, forming a record that cannot be changed without redoing \nthe proof-of-work.  The longest chain not only serves as proof of the sequence of \nevents witnessed, but proof that it came from the largest pool of CPU power.  As \nlong as a majority of CPU power is controlled by nodes that are not cooperating to \nattack the network, they'll generate the longest chain and outpace attackers.  The \nnetwork itself requires minimal structure.  Messages are broadcast on a best effort \nbasis, and nodes can leave and rejoin the network at will, accepting the longest \nproof-of-work chain as proof of what happened while they were gone.\n1. Introduction\nCommerce on the Internet has come to rely almost exclusively on financial institutions serving as \ntrusted third parties to process electronic payments.  While the system works well enough for \nmost transactions, it still suffers from the inherent weaknesses of the trust based model. \nCompletely non-reversible transactions are not really possible, since financial institutions cannot \navoid mediating disputes.   The cost of mediation increases transaction costs, limiting the \nminimum practical transaction size and cutting off the possibility for small casual transactions, \nand there is a broader cost in the loss of ability to make non-reversible payments for non-\nreversible services.  With the possibility of reversal, the need for trust spreads.  Merchants must \nbe wary of their customers, hassling them for more information than they would otherwise need. \nA certain percentage of fraud is accepted as unavoidable.  These costs and payment uncertainties \ncan be avoided in person by using physical currency, but no mechanism exists to make payments \n",
      "path": "C:/Users/alenk/Desktop/bitcoin.pdf",
      "index": 0
    },
    {
      "id": "4df9cabd-65b5-40fa-b77b-63f09a5fc8bb",
      "title": "C:/Users/alenk/Desktop/bitcoin.pdf (0)",
      "type": "pdf",
      "content": "over a communications channel without a trusted party.\nWhat is needed is an electronic payment system based on cryptographic proof instead of trust, \nallowing any two willing parties to transact directly with each other without the need for a trusted \nthird party.  Transactions that are computationally impractical to reverse would protect sellers \nfrom fraud, and routine escrow mechanisms could easily be implemented to protect buyers.  In \nthis paper, we propose a solution to the double-spending problem using a peer-to-peer distributed \ntimestamp server to generate computational proof of the chronological order of transactions.  The \nsystem is secure as long as honest nodes collectively control more CPU power than any \ncooperating group of attacker nodes.\n2. Transactions\nWe define an electronic coin as a chain of digital signatures.  Each owner transfers the coin to the \nnext by digitally signing a hash of the previous transaction and the public key of the next owner \nThe problem of course is the payee can't verify that one of the owners did not double-spend \nthe coin.  A common solution is to introduce a trusted central authority, or mint, that checks every \ntransaction for double spending.  After each transaction, the coin must be returned to the mint to \nissue a new coin, and only coins issued directly from the mint are trusted not to be double-spent. \nThe problem with this solution is that the fate of the entire money system depends on the \ncompany running the mint, with every transaction having to go through them, just like a bank.\ntransactions.  For our purposes, the earliest transaction is the one that counts, so we don't care \nabout later attempts to double-spend.  The only way to confirm the absence of a transaction is to \nbe aware of all transactions.  In the mint based model, the mint was aware of all transactions and \ndecided which arrived first.  To accomplish this without a trusted party, transactions must be \npublicly announced [1], and we need a system for participants to agree on a single history of the \norder in which they were received.  The payee needs proof that at the time of each transaction, the \nmajority of nodes agreed it was the first received. \n3. Timestamp Server\nThe solution we propose",
      "path": "C:/Users/alenk/Desktop/bitcoin.pdf",
      "index": 0
    },
    {
      "id": "4828d59e-6c58-4170-bb06-274257c4c62d",
      "title": "C:/Users/alenk/Desktop/bitcoin.pdf (1)",
      "type": "pdf",
      "content": " begins with a timestamp server.  A timestamp server works by taking a \nnewspaper or Usenet post [2-5].  The timestamp proves that the data must have existed at the \ntime, obviously, in order to get into the hash.  Each timestamp includes the previous timestamp in \nits hash, forming a chain, with each additional timestamp reinforcing the ones before it.\n4. Proof-of-Work\nTo implement a distributed timestamp server on a peer-to-peer basis, we will need to use a proof-\nof-work system similar to Adam Back's Hashcash [6], rather than newspaper or Usenet posts. \nThe proof-of-work involves scanning for a value that when hashed, such as with SHA-256, the \nhash begins with a number of zero bits.  The average work required is exponential in the number \nof zero bits required and can be verified by executing a single hash.\nFor our timestamp network, we implement the proof-of-work by incrementing a nonce in the \nblock until a value is found that gives the block's hash the required zero bits.  Once the CPU \neffort has been expended to make it satisfy the proof-of-work, the block cannot be changed \nwithout redoing the work.  As later blocks are chained after it, the work to change the block \nwould include redoing all the blocks after it.\nThe proof-of-work also solves the problem of determining representation in majority decision \nmaking.  If the majority were based on one-IP-address-one-vote, it could be subverted by anyone \nable to allocate many IPs.  Proof-of-work is essentially one-CPU-one-vote.  The majority \ndecision is represented by the longest chain, which has the greatest proof-of-work effort invested \nfastest and outpace any competing chains.  To modify a past block, an attacker would have to \nredo the proof-of-work of the block and all blocks after it and then catch up with and surpass the \nwork of the honest nodes.  We will show later that the probability of a slower attacker catching up \ndiminishes exponentially as subsequent blocks are added.\nTo compensate for increasing hardware speed and varying interest in",
      "path": "C:/Users/alenk/Desktop/bitcoin.pdf",
      "index": 1
    },
    {
      "id": "8dd3810b-51a4-4129-adea-44a40fa13fbf",
      "title": "C:/Users/alenk/Desktop/bitcoin.pdf (2)",
      "type": "pdf",
      "content": " running nodes over time, \nthe proof-of-work difficulty is determined by a moving average targeting an average number of \nblocks per hour.  If they're generated too fast, the difficulty increases.\n5. Network\nThe steps to run the network are as follows:\n1) New transactions are broadcast to all nodes.\n2) Each node collects new transactions into a block.  \n3) Each node works on finding a difficult proof-of-work for its block.\n4) When a node finds a proof-of-work, it broadcasts the block to all nodes.\n5) Nodes accept the block only if all transactions in it are valid and not already spent.\n6) Nodes express their acceptance of the block by working on creating the next block in the \nchain, using the hash of the accepted block as the previous hash.\nNodes always consider the longest chain to be the correct one and will keep working on \nextending it.  If two nodes broadcast different versions of the next block simultaneously, some \nbut save the other branch in case it becomes longer.  The tie will be broken when the next proof-\nof-work is found and one branch becomes longer; the nodes that were working on the other \nbranch will then switch to the longer one.\nNew transaction broadcasts do not necessarily need to reach all nodes.  As long as they reach \nmany nodes, they will get into a block before long.  Block broadcasts are also tolerant of dropped \nrealizes it missed one.\n6. Incentive\nBy convention, the first transaction in a block is a special transaction that starts a new coin owned \nby the creator of the block.  This adds an incentive for nodes to support the network, and provides \na way to initially distribute coins into circulation, since there is no central authority to issue them. \nThe steady addition of a constant of amount of new coins is analogous to gold miners expending \nresources to add gold to circulation.  In our case, it is CPU time and electricity that is expended.\nThe incentive can also be funded with transaction fees.  If the output value of a transaction is \nless than its input value, the difference is a transaction fee that is added to the incentive value of \nthe block containing the transaction.  Once a predetermined",
      "path": "C:/Users/alenk/Desktop/bitcoin.pdf",
      "index": 2
    },
    {
      "id": "69e9ff56-8456-4df7-884c-aa9e623d1933",
      "title": "C:/Users/alenk/Desktop/bitcoin.pdf (3)",
      "type": "pdf",
      "content": " number of coins have entered \ncirculation, the incentive can transition entirely to transaction fees and be completely inflation \nThe incentive may help encourage nodes to stay honest.  If a greedy attacker is able to \nassemble more CPU power than all the honest nodes, he would have to choose between using it \nto defraud people by stealing back his payments, or using it to generate new coins.  He ought to \nfind it more profitable to play by the rules, such rules that favour him with more new coins than \neveryone else combined, than to undermine the system and the validity of his own wealth.\n7. Reclaiming Disk Space\nOnce the latest transaction in a coin is buried under enough blocks, the spent transactions before \nit can be discarded to save disk space.  To facilitate this without breaking the block's hash, \ntransactions are hashed in a Merkle Tree [7][2][5], with only the root included in the block's hash. \nOld blocks can then be compacted by stubbing off branches of the tree.  The interior hashes do \nnot need to be stored.\nTransactions Hashed in a Merkle Tree After Pruning Tx0-2 from the Block\nA block header with no transactions would be about 80 bytes.  If we suppose blocks are \ntypically selling with 2GB of RAM as of 2008, and Moore's Law predicting current growth of \n1.2GB per year, storage should not be a problem even if the block headers must be kept in \n8. Simplified Payment Verification\nIt is possible to verify payments without running a full network node.  A user only needs to keep \na copy of the block headers of the longest proof-of-work chain, which he can get by querying \nnetwork nodes until he's convinced he has the longest chain, and obtain the Merkle branch \nlinking the transaction to the block it's timestamped in.  He can't check the transaction for \nand blocks added after it further confirm the network has accepted it.\nMerkle Branch for Tx3\nAs such, the verification is reliable as long as honest nodes control the network, but is more \nvulnerable if the network is overpowered by an attacker.  While network nodes can verify \ntransactions for",
      "path": "C:/Users/alenk/Desktop/bitcoin.pdf",
      "index": 3
    },
    {
      "id": "e48bb752-4af1-4ff4-9bd8-9f74453ff98a",
      "title": "C:/Users/alenk/Desktop/bitcoin.pdf (4)",
      "type": "pdf",
      "content": " themselves, the simplified method can be fooled by an attacker's fabricated \ntransactions for as long as the attacker can continue to overpower the network.  One strategy to \nprotect against this would be to accept alerts from network nodes when they detect an invalid \nblock, prompting the user's software to download the full block and alerted transactions to \nconfirm the inconsistency.  Businesses that receive frequent payments will probably still want to \nrun their own nodes for more independent security and quicker verification.\n9. Combining and Splitting Value\nAlthough it would be possible to handle coins individually, it would be unwieldy to make a \nseparate transaction for every cent in a transfer.  To allow value to be split and combined, \ntransactions contain multiple inputs and outputs.  Normally there will be either a single input \nfrom a larger previous transaction or multiple inputs combining smaller amounts, and at most two \noutputs: one for the payment, and one returning the change, if any, back to the sender.  \nIn Out\nIn...\nIt should be noted that fan-out, where a transaction depends on several transactions, and those \ntransactions depend on many more, is not a problem here.  There is never the need to extract a \ncomplete standalone copy of a transaction's history.\n10. Privacy\nThe traditional banking model achieves a level of privacy by limiting access to information to the \nparties involved and the trusted third party.  The necessity to announce all transactions publicly \nprecludes this method, but privacy can still be maintained by breaking the flow of information in \nanother place: by keeping public keys anonymous.  The public can see that someone is sending \nan amount to someone else, but without information linking the transaction to anyone.  This is \nsimilar to the level of information released by stock exchanges, where the time and size of \nindividual trades, the \"tape\", is made public, but without telling who the parties were.\nAs an additional firewall, a new key pair should be used for each transaction to keep them \nfrom being linked to a common owner.  Some linking is still unavoidable with multi-input \ntransactions, which necessarily reveal that their inputs were owned by the same owner.  The risk \nis that if the owner of a key is revealed,",
      "path": "C:/Users/alenk/Desktop/bitcoin.pdf",
      "index": 4
    },
    {
      "id": "cae89f2b-adb7-44b5-b1cc-a7a88d282d50",
      "title": "C:/Users/alenk/Desktop/bitcoin.pdf (5)",
      "type": "pdf",
      "content": " linking could reveal other transactions that belonged to \nthe same owner.\n11. Calculations\nWe consider the scenario of an attacker trying to generate an alternate chain faster than the honest \nchain.  Even if this is accomplished, it does not throw the system open to arbitrary changes, such \nas creating value out of thin air or taking money that never belonged to the attacker.  Nodes are \nnot going to accept an invalid transaction as payment, and honest nodes will never accept a block \ncontaining them.  An attacker can only try to change one of his own transactions to take back \nmoney he recently spent.\nThe race between the honest chain and an attacker chain can be characterized as a Binomial \nRandom Walk.  The success event is the honest chain being extended by one block, increasing its \nlead by +1, and the failure event is the attacker's chain being extended by one block, reducing the \ngap by -1.\nThe probability of an attacker catching up from a given deficit is analogous to a Gambler's \nRuin problem.  Suppose a gambler with unlimited credit starts at a deficit and plays potentially an \ninfinite number of trials to try to reach breakeven.  We can calculate the probability he ever \nreaches breakeven, or that an attacker ever catches up with the honest chain, as follows [8]:\np = probability an honest node finds the next block\nq = probability the attacker finds the next block\nq = probability the attacker will ever catch up from z blocks behind\nGiven our assumption that p > q, the probability drops exponentially as the number of blocks the \nattacker has to catch up with increases.  With the odds against him, if he doesn't make a lucky \nlunge forward early on, his chances become vanishingly small as he falls further behind.\nWe now consider how long the recipient of a new transaction needs to wait before being \nsufficiently certain the sender can't change the transaction.  We assume the sender is an attacker \nhimself after some time has passed.  The receiver will be alerted when that happens, but the \nsender hopes it will be too late.\nThe receiver generates a new key pair and gives the public key to the sender shortly before \nsigning.  This prevents the sender from preparing a",
      "path": "C:/Users/alenk/Desktop/bitcoin.pdf",
      "index": 5
    },
    {
      "id": "7b1c4d01-b198-42b3-8e2c-8e65bce32581",
      "title": "C:/Users/alenk/Desktop/bitcoin.pdf (6)",
      "type": "pdf",
      "content": " chain of blocks ahead of time by working on \nit continuously until he is lucky enough to get far enough ahead, then executing the transaction at \nthat moment.  Once the transaction is sent, the dishonest sender starts working in secret on a \nparallel chain containing an alternate version of his transaction.\nThe recipient waits until the transaction has been added to a block and z blocks have been \nlinked after it.  He doesn't know the exact amount of progress the attacker has made, but \nassuming the honest blocks took the average expected time per block, the attacker's potential \nprogress will be a Poisson distribution with expected value:\nTo get the probability the attacker could still catch up now, we multiply the Poisson density for \neach amount of progress he could have made by the probability he could catch up from that point:\nRearranging to avoid summing the infinite tail of the distribution...\nConverting to C code...\nRunning some results, we can see the probability drop off exponentially with z.\nSolving for P less than 0.1%...\n12. Conclusion\nWe have proposed a system for electronic transactions without relying on trust.  We started with \nthe usual framework of coins made from digital signatures, which provides strong control of \nownership, but is incomplete without a way to prevent double-spending.  To solve this, we \nproposed a peer-to-peer network using proof-of-work to record a public history of transactions \nthat quickly becomes computationally impractical for an attacker to change if honest nodes \ncontrol a majority of CPU power.  The network is robust in its unstructured simplicity.  Nodes \nwork all at once with little coordination.  They do not need to be identified, since messages are \nnot routed to any particular place and only need to be delivered on a best effort basis.  Nodes can \nleave and rejoin the network at will, accepting the proof-of-work chain as proof of what \nhappened while they were gone.  They vote with their CPU power, expressing their acceptance of \nvalid blocks by working on extending them and rejecting invalid blocks by refusing to work on \nthem.  Any needed rules and incentives can be enforced with this consensus mechanism.\n[1] W. Dai, \"b-money,\"",
      "path": "C:/Users/alenk/Desktop/bitcoin.pdf",
      "index": 6
    },
    {
      "id": "e034d793-c235-40ac-b1f3-e3cc0abc32ab",
      "title": "C:/Users/alenk/Desktop/bitcoin.pdf (8)",
      "type": "pdf",
      "content": " http://www.weidai.com/bmoney.txt, 1998.\n[2] H. Massias, X.S. Avila, and J.-J. Quisquater, \"Design of a secure timestamping service with minimal \ntrust requirements,\" In 20th Symposium on Information Theory in the Benelux, May 1999.\n[3] S. Haber, W.S. Stornetta, \"How to time-stamp a digital document,\" In Journal of Cryptology, vol 3, no \n[4] D. Bayer, S. Haber, W.S. Stornetta, \"Improving the efficiency and reliability of digital time-stamping,\" \nIn Sequences II: Methods in Communication, Security and Computer Science, pages 329-334, 1993.\n[5] S. Haber, W.S. Stornetta, \"Secure names for bit-strings,\" In Proceedings of the 4th ACM Conference \non Computer and Communications Security, pages 28-35, April 1997.\n[6] A. Back, \"Hashcash - a denial of service counter-measure,\" \n[7] R.C. Merkle, \"Protocols for public key cryptosystems,\" In Proc. 1980 Symposium on Security and \n[8] W. Feller, \"An introduction to probability theory and its applications,\" 1957.\n",
      "path": "C:/Users/alenk/Desktop/bitcoin.pdf",
      "index": 8
    }
  ],
  "pages": [
    {
      "id": "4d75e01a-97a8-4a3f-8d48-6336d65e1a6b",
      "references": [
        {
          "id": "06cd2ef2-975c-46f3-bf3c-4ad725d36a7f",
          "title": "C:/Users/alenk/Desktop/bitcoin.pdf (0)",
          "sourceId": "4151632a-8b92-49e0-939a-442220827bef"
        }
      ],
      "layout": {
        "id": "b1ef9df9-52a3-4972-8d5d-06e0f7602f61",
        "position": 0,
        "size": 1,
        "orientation": "horizontal",
        "previous": null,
        "next": null,
        "children": [
          {
            "id": "3cc447af-8f61-4456-a8d2-702775fd0a56",
            "position": 0,
            "size": 1,
            "previous": null,
            "next": null,
            "props": { "type": "default", "paramId": null },
            "type": "pane"
          }
        ],
        "type": "layout"
      },
      "content": {
        "ops": [
          {
            "insert": "Bitcoin: A Peer-to-Peer Electronic Cash SystemAbstract. A purely peer-to-peer version of electronic cash would allow online payments to be sent directly from one party to another without going through a financial institution. Digital signatures provide part of the solution, but the main benefits are lost if a trusted third party is still required to prevent double-spending. We propose a solution to the double-spending problem using a peer-to-peer network. The network timestamps transactions by hashing them into an ongoing chain of hash-based proof-of-work, forming a record that cannot be changed without redoing the proof-of-work. The longest chain not only serves as proof of the sequence of events witnessed, but proof that it came from the largest pool of CPU power. As long as a majority of CPU power is controlled by nodes that are not cooperating to attack the network, they'll generate the longest chain and outpace attackers. The network itself requires minimal structure. Messages are broadcast on a best effort basis, and nodes can leave and rejoin the network at will, accepting the longest proof-of-work chain as proof of what happened while they were gone.\n\n"
          },
          { "insert": { "generation": "Bitcoin is" } },
          { "insert": "\n\n" }
        ]
      },
      "quills": []
    },
    {
      "id": "4b285bbe-817c-4461-b811-5149212556ab",
      "references": [
        {
          "id": "99bcdae1-0f4d-468d-8ec2-ecb39447f0f1",
          "title": "C:/Users/alenk/Desktop/bitcoin.pdf (0)",
          "sourceId": "4df9cabd-65b5-40fa-b77b-63f09a5fc8bb"
        }
      ],
      "layout": {
        "id": "3304a9fe-b52b-49f2-a12a-f6cd6445c799",
        "position": 0,
        "size": 1,
        "orientation": "horizontal",
        "previous": null,
        "next": null,
        "children": [
          {
            "id": "2f364046-3787-4d75-a987-98b84ac650e9",
            "position": 0,
            "size": 1,
            "previous": null,
            "next": null,
            "props": { "type": "default", "paramId": null },
            "type": "pane"
          }
        ],
        "type": "layout"
      },
      "content": {
        "ops": [
          {
            "insert": "Payment systems based on proof-of-work have a number of disadvantages. They consume \ncomputational resources: most of the processing power is spent on the proof-of-work, not \non useful work. They consume electricity: the work must be performed in real time and \nreal time means electricity. They consume hardware: the work must be performed \nin real time and real time means hardware. They consume space: the proof-of-work must be stored \nsomewhere. They are susceptible to denial-of-service attacks.\nThe proof-of-work used by Bitcoin is a great idea, but it is not costless. \nWe propose a new solution based on Trusted Computing that we believe will solve these problems.\n\n"
          }
        ]
      },
      "quills": []
    },
    {
      "id": "da1e09d6-3006-47b9-bedc-68621ffcfb5d",
      "references": [
        {
          "id": "889b569f-0403-479b-a067-c81be7b39fd7",
          "title": "C:/Users/alenk/Desktop/bitcoin.pdf (1)",
          "sourceId": "4828d59e-6c58-4170-bb06-274257c4c62d"
        }
      ],
      "layout": {
        "id": "b13d91b3-b72f-4f5c-a1b1-e7e4d7ccf343",
        "position": 0,
        "size": 1,
        "orientation": "horizontal",
        "previous": null,
        "next": null,
        "children": [
          {
            "id": "11a86a98-b117-4c73-a339-b61384efda99",
            "position": 0,
            "size": 1,
            "previous": null,
            "next": null,
            "props": { "type": "default", "paramId": null },
            "type": "pane"
          }
        ],
        "type": "layout"
      },
      "content": {
        "ops": [
          {
            "insert": "Jupiter is the fifth planet from the Sun and the largest in the Solar System. It is a gas giant with a mass more than two and a half times that of all the other planets in the Solar System combined, but slightly less than one-thousandth the mass of the Sun. Jupiter is the third-brightest natural object in the Earth's night sky after the Moon and Venus. It has been observed since pre-historic times and is named after the Roman god Jupiter, the king of the gods, because of its observed size.\nJupiter is primarily composed of hydrogen, but helium constitutes one quarter of its mass and one tenth of its volume. It likely has a rocky core of heavier elements, but like the other giant planets, Jupiter lacks a well-defined solid surface. The on-going contraction of its interior generates heat greater than the amount received from the Sun. Because of its rapid rotation, the planet's shape is that of an oblate spheroid; it has a slight but noticeable bulge around the equator. The outer atmosphere is visibly segregated into several bands at different latitudes, with turbulence and storms along their interacting boundaries. A prominent result of this is the Great Red Spot, a giant storm that is known to have existed since\n\n"
          }
        ]
      },
      "quills": []
    },
    {
      "id": "01b8ffa3-bfe2-451d-b24c-42f94a67bb1c",
      "references": [
        {
          "id": "8b48c28f-85b2-429c-b964-0200c60e209a",
          "title": "C:/Users/alenk/Desktop/bitcoin.pdf (2)",
          "sourceId": "8dd3810b-51a4-4129-adea-44a40fa13fbf"
        }
      ],
      "layout": {
        "id": "b91bcbe0-8bf6-47cd-890b-8d8d29690c16",
        "position": 0,
        "size": 1,
        "orientation": "horizontal",
        "previous": null,
        "next": null,
        "children": [
          {
            "id": "3432e6db-10e2-4411-9640-81eb16e56916",
            "position": 0,
            "size": 1,
            "previous": null,
            "next": null,
            "props": { "type": "default", "paramId": null },
            "type": "pane"
          }
        ],
        "type": "layout"
      },
      "content": {
        "ops": [
          {
            "insert": "The steps to run the network are as follows:\n1) New transactions are broadcast to all nodes.\n2) Each node collects new transactions into a block.  \n3) Each node works on finding a difficult proof-of-work for its block.\n4) When a node finds a proof-of-work, it broadcasts the block to all nodes.\n5) Nodes accept the block only if all transactions in it are valid and not already spent.\n6) Nodes express their acceptance of the block by working on creating the next block in the \nchain, using the hash of the accepted block as the previous hash. \nNodes always consider the longest chain to be the correct one and will keep working on \nextending it.  If two nodes broadcast different versions of the next block simultaneously, some \nbut save the other branch in case it becomes longer.  The tie will be broken when the next proof-\nof-work is found and one branch becomes longer; the nodes that were working on the other \nbranch will then switch to the longer one.\nNew transaction broadcasts do not necessarily need to reach all nodes.  As long as they reach \nmany nodes, they will get into\n\n"
          }
        ]
      },
      "quills": []
    },
    {
      "id": "5bfeb600-2fed-4ff9-b425-ea31c8955c0f",
      "references": [
        {
          "id": "883d8ed0-0e48-4b40-b7d9-1066bb82af55",
          "title": "C:/Users/alenk/Desktop/bitcoin.pdf (3)",
          "sourceId": "69e9ff56-8456-4df7-884c-aa9e623d1933"
        }
      ],
      "layout": {
        "id": "31cdd628-697a-4b2f-a058-449267bee9b8",
        "position": 0,
        "size": 1,
        "orientation": "horizontal",
        "previous": null,
        "next": null,
        "children": [
          {
            "id": "651ff2d7-53fb-4045-b8c1-640096d3f2d5",
            "position": 0,
            "size": 1,
            "previous": null,
            "next": null,
            "props": { "type": "default", "paramId": null },
            "type": "pane"
          }
        ],
        "type": "layout"
      },
      "content": {
        "ops": [
          {
            "insert": "Payment verification is a critical part of Bitcoin that is often overlooked.  It is a \ncritical part because it determines how easy it is to create new coins and how hard it is to \ndouble spend coins.  The Bitcoin system is based on the idea that coins are not easily \ndouble spent.  An attacker that can double spend a coin can easily cause large financial losses \nto the person who owns the coin.  The first section of this paper will explain the basics of how \ntransactions are verified by nodes in the Bitcoin system. The second section will explain how a \nnode can verify that a transaction is included in a block and how the node can verify that the \tblock is part of the longest chain. \tThe final section will describe some weaknesses that can be exploited by an attacker to \tdouble spend coins.\n\n"
          }
        ]
      },
      "quills": []
    },
    {
      "id": "c79c9eb1-d15c-4225-b5a7-bba7da68c8db",
      "references": [
        {
          "id": "c1ff01a6-7b98-438b-becc-8dacd3c80c39",
          "title": "C:/Users/alenk/Desktop/bitcoin.pdf (4)",
          "sourceId": "e48bb752-4af1-4ff4-9bd8-9f74453ff98a"
        }
      ],
      "layout": {
        "id": "08817f6b-71bf-42f3-8816-31d729292d86",
        "position": 0,
        "size": 1,
        "orientation": "horizontal",
        "previous": null,
        "next": null,
        "children": [
          {
            "id": "bc367db6-6b7e-46f7-bae4-4eea81974203",
            "position": 0,
            "size": 1,
            "previous": null,
            "next": null,
            "props": { "type": "default", "paramId": null },
            "type": "pane"
          }
        ],
        "type": "layout"
      },
      "content": {
        "ops": [
          {
            "insert": "Payment \nis a core feature of Bitcoin that allows users to transfer value between each other.  Bitcoin \npayments are made up of digitally signed transactions that are broadcast to the network and \nverify in a block chain.  Each input must refer to a previous unspent output in the blockchain. \nIn order to prevent double spending, each input must not only be signed by the owner, but also \ncontain a proof-of-work.  The network verifies the signatures using a public key cryptography \nsystem and confirms that the input amount has been transferred to the correct output.  To avoid \ndouble spending, each input must not only be signed by an owner, but must also include a proof-of-work.\nThe system is designed to confirm transactions as fast as possible.  The more confirmations that a \ntransaction has, the more difficult it is for an attacker to successfully reverse the transaction in a \nchain reversal.  Merchants and services that receive frequent payments will probably still want to run \ntheir own nodes for more independent security and quicker verification.\n11. Double Spending and the Byzantine Generals Problem\nAn important, non-technical difference is that Bitcoin has no central authority\n\n"
          }
        ]
      },
      "quills": []
    },
    {
      "id": "3b73c669-a21c-4c97-9546-f378638f13eb",
      "references": [
        {
          "id": "31f225df-c5e5-4a15-8174-c47158224b8f",
          "title": "C:/Users/alenk/Desktop/bitcoin.pdf (5)",
          "sourceId": "cae89f2b-adb7-44b5-b1cc-a7a88d282d50"
        }
      ],
      "layout": {
        "id": "dd23d66d-3edf-49d8-82fd-44893ff1aec8",
        "position": 0,
        "size": 1,
        "orientation": "horizontal",
        "previous": null,
        "next": null,
        "children": [
          {
            "id": "abd925a2-d208-4797-864f-afeb1875228f",
            "position": 0,
            "size": 1,
            "previous": null,
            "next": null,
            "props": { "type": "default", "paramId": null },
            "type": "pane"
          }
        ],
        "type": "layout"
      },
      "content": {
        "ops": [
          {
            "insert": "Jupiter is the fifth planet from the Sun and the largest in the Solar System. It is a gas giant with a mass more than two and a half times that of all the other planets in the Solar System combined, but slightly less than one-thousandth the mass of the Sun. Jupiter is the third-brightest natural object in the Earth's night sky after the Moon and Venus. It has been observed since pre-historic times and is named after the Roman god Jupiter, the king of the gods, because of its observed size.\n\nJupiter is primarily composed of hydrogen, but helium constitutes one quarter of its mass and one tenth of its volume. It likely has a rocky core of heavier elements, but like the other giant planets, Jupiter lacks a well-defined solid surface. The on-going contraction of its interior generates heat greater than the amount received from the Sun. Because of its rapid rotation, the planet's shape is that of an oblate spheroid; it has a slight but noticeable bulge around the equator. The outer atmosphere is visibly segregated into several bands at different latitudes, with turbulence and storms along their interacting boundaries. A prominent result of this is the Great Red Spot, a giant storm that is known to have existed\n\n"
          }
        ]
      },
      "quills": []
    },
    {
      "id": "1396b3ba-30bd-425f-ad1d-acb2bdf4367d",
      "references": [
        {
          "id": "38a5d4db-b96d-4269-b409-239f92a8b01e",
          "title": "C:/Users/alenk/Desktop/bitcoin.pdf (6)",
          "sourceId": "7b1c4d01-b198-42b3-8e2c-8e65bce32581"
        }
      ],
      "layout": {
        "id": "23b5a6a3-e72b-486f-9193-6bd4cb3f6060",
        "position": 0,
        "size": 1,
        "orientation": "horizontal",
        "previous": null,
        "next": null,
        "children": [
          {
            "id": "90a860db-94ed-4b95-a254-a71e9456394e",
            "position": 0,
            "size": 1,
            "previous": null,
            "next": null,
            "props": { "type": "default", "paramId": null },
            "type": "pane"
          }
        ],
        "type": "layout"
      },
      "content": {
        "ops": [
          {
            "insert": " b-money is a very simple, extremely limited cryptocurrency that is \nstill valuable as a demonstration of the principles involved. \nIt has its own wiki page at https://en.bitcoin.it/wiki/B-money .\n[1] W. Dai, \"b-money,\n\n"
          }
        ]
      },
      "quills": []
    },
    {
      "id": "b9d83126-efc9-4226-9074-11560e3e00d2",
      "references": [
        {
          "id": "d578ebbf-caba-4885-a61d-3e0a61c902d5",
          "title": "C:/Users/alenk/Desktop/bitcoin.pdf (8)",
          "sourceId": "e034d793-c235-40ac-b1f3-e3cc0abc32ab"
        }
      ],
      "layout": {
        "id": "d5785560-093f-4f04-b307-e3da9765bd30",
        "position": 0,
        "size": 1,
        "orientation": "horizontal",
        "previous": null,
        "next": null,
        "children": [
          {
            "id": "3bd66062-2c79-412b-b183-a604f59b79d7",
            "position": 0,
            "size": 1,
            "previous": null,
            "next": null,
            "props": { "type": "default", "paramId": null },
            "type": "pane"
          }
        ],
        "type": "layout"
      },
      "content": {
        "ops": [
          {
            "insert": "\nIn cryptography, a hash function is any function that can be used to map data of arbitrary size to data of a fixed size. Hash functions are also called message digest functions, one-way hash functions, or one-way encryption functions.\nThe values returned by a hash function are called hash values, hash sums, checksums, or simply hashes.\n\nHash functions are related to (and can be used as) checksums. Checksums are used for error detection in communications and storage systems—a simple hash function is often used to generate a checksum. However, checksums are not secure in the sense that cryptographic hash functions are; they do not guarantee the integrity of the data, only its authenticity (i.e., that it has not been modified in an undetectable way).\n\nA cryptographic hash function has three main properties: it is easy to compute the hash value for any given message, but infeasible to find a message that corresponds to a given hash value (a property known as strong collision resistance), and it is infeasible to find two different messages that produce the same hash value (a property known as strong uniqueness).\n\nCryptographic hash functions are used for:\n\nHash functions can be classified into two categories,\n\n"
          }
        ]
      },
      "quills": []
    }
  ]
}
